Catalogs/РабочиеМестаОхраныТруда.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>РабочиеМестаОхраныТруда</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Организации</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядковыйНомер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УсловияТруда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УсловияТруда</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновноеРабочееМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеМестаОхраныТруда</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВручную</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВАрхиве</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоответствуетУсловиямТруда</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВзимаютсяВзносыЗаЗанятыхНаРаботахСДосрочнойПенсией</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыРаботСДосрочнойПенсией</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеДосрочногоНазначенияПенсии</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОснованияДосрочногоНазначенияПенсии</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсобыеУсловияТрудаПФР</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсобыеУсловияТрудаПФР</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПозицииСпискаПФР</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпискиПрофессийДолжностейЛьготногоПенсионногоОбеспечения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыплачиваетсяНадбавкаЗаВредность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентНадбавкиЗаВредность</Name>
					<Comment>АПК:58 различия имени и синонима оправданы</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоДнейДополнительногоОтпускаВГод</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьДолжностьПоШтатномуРасписанию</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШтатноеРасписание</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХарактерВыполняемыхРаботПФР</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПервичныеДокументыПФР</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВредныеФакторыСопоставлены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ВредныеФакторыИВидыРаботРабочегоМеста.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ВредныеФакторыИВидыРаботРабочегоМеста</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РезультатыСпецоценкиУсловийТруда</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>РабочееМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеМестаОхраныТруда</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВредныйФактор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВредныеОпасныеПроизводственныеФакторыИВыполняемыеРаботы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОсмотра</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОбследований</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ВредныеФакторыРабочегоМеста.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ВредныеФакторыРабочегоМеста</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>РабочееМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеМестаОхраныТруда</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВредныйФактор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВредныеОпасныеПроизводственныеФакторы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОсмотра</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОбследований</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ВидыРаботМедицинскихОсмотровРабочегоМеста.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ВидыРаботМедицинскихОсмотровРабочегоМеста</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>РабочееМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеМестаОхраныТруда</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидРабот</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыРаботМедицинскихОсмотров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОсмотра</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОбследований</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыОбследований.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыОбследований</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>МедицинскийОсмотр</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПсихиатрическоеОсвидетельствование</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/РабочиеМестаОхраныТруда/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Первоначальное заполнение объекта.
	Если Параметры.Ключ.Пустая() Тогда
		// ЗУПК
		СобытияФормЗУПК.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
		// ЗУПК
		СсылкаНаОбъект = ОбщегоНазначения.МенеджерОбъектаПоСсылке(Объект.Ссылка).ПолучитьСсылку();
		ПриПолученииДанныхНаСервере(Параметры.ЗначениеКопирования);
		ЗаполнитьНомер();
		СформироватьАвтоматическийНомер();
	КонецЕсли;
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
		
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	ПриПолученииДанныхНаСервере(ТекущийОбъект);
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьМедицинскиеОсмотры") Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПравоДоступа("Чтение", Метаданные.РегистрыСведений.ПериодичностьМедицинскихОсмотровРабочихМест) Тогда
		Возврат;
	КонецЕсли;
	
	МедицинскиеОсмотры.ЗапуститьОбновлениеПериодическихОсмотров(ТекущийОбъект.Владелец);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// СтандартныеПодсистемы.Свойства
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
	Если ИмяСобытия = "Запись_УсловияТруда" И Источник = Объект.УсловияТруда Тогда
		УстановитьПредупреждениеОРазличияхСУсловиямиТруда();
	ИначеЕсли ИмяСобытия = "ОтредактированаИстория" И Параметр.ИмяРегистра = "КлассыУсловийТрудаПоДолжностям" Тогда
		Если КлассыУсловийТрудаПоДолжностямНаборЗаписейПрочитан Тогда
			РедактированиеПериодическихСведенийКлиент.ОбработкаОповещения(ЭтотОбъект, СсылкаНаОбъект, ИмяСобытия, Параметр, Источник);
			ОбновитьПолеКлассыУсловийТрудаПоДолжностямПериод(ЭтотОбъект);
			УстановитьЗаголовокСвернутогоОтображенияСтраховыхВзносов(ЭтотОбъект);	
		КонецЕсли;
	ИначеЕсли ИмяСобытия = "Запись_РезультатыСпецоценкиУсловийТруда" Тогда		
		ИнициализироватьРезультатыСпецоценки(СсылкаНаОбъект);
	КонецЕсли;
	
	ТекстПодсказкиКПоляДатаРегистрации = УчетСтраховыхВзносовКлиентСервер.ТекстПодсказкиПоляДатаРегистрацииПериодическихРегистров();
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, 
		"КлассыУсловийТрудаПоДолжностямДатаРегистрацииИзменений", 
		"Подсказка", 
		ТекстПодсказкиКПоляДатаРегистрации);

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// ЗУПК
	СобытияФормЗУПК.ПриЧтенииНаСервере(ЭтаФорма);
	// ЗУПК
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	СсылкаНаОбъект = ТекущийОбъект.Ссылка;
	ПриПолученииДанныхНаСервере(ТекущийОбъект);
		
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	Если Параметры.Ключ.Пустая() Тогда
		ТекущийОбъект.УстановитьСсылкуНового(СсылкаНаОбъект);
	КонецЕсли;
	
	ТекущийОбъект.СоответствуетУсловиямТруда = СоответствуетУсловиямТруда;
	
	Если Не ИспользоватьСпециальнуюОценкуУсловийТруда Тогда
		РедактированиеПериодическихСведений.ЗаписатьЗаписьПослеРедактированияВФорме(ЭтотОбъект, "КлассыУсловийТрудаПоДолжностям", СсылкаНаОбъект);
		РедактированиеПериодическихСведений.ЗаписатьЗаписьПослеРедактированияВФорме(ЭтотОбъект, "АналогичныеРабочиеМестаСпециальнойОценкиУсловийТруда", СсылкаНаОбъект);
	КонецЕсли;
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьМедицинскиеОсмотры") Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПравоДоступа("Чтение", Метаданные.РегистрыСведений.ПериодичностьМедицинскихОсмотровРабочихМест) Тогда
		Возврат;
	КонецЕсли;
	
	МедицинскиеОсмотрыФормы.УдалитьДублиФакторовВидовРаботРабочегоМеста(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Не ПравоДоступа("Чтение", Метаданные.РегистрыСведений.ПериодичностьМедицинскихОсмотровРабочихМест) Тогда
		Возврат;
	КонецЕсли;
		
	УстановитьПривилегированныйРежим(Истина);
	ЗаписатьВредныеФакторы(ЭтотОбъект, Отказ, ТекущийОбъект, "ВредныеФакторыИВидыРабот");
	ЗаписатьВредныеФакторы(ЭтотОбъект, Отказ, ТекущийОбъект, "ВредныеФакторы");
	ЗаписатьВидыРабот(ЭтотОбъект, Отказ, ТекущийОбъект);
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
	
	РедактированиеПериодическихСведений.ПроверитьЗаписьВФорме(ЭтотОбъект, "КлассыУсловийТрудаПоДолжностям", СсылкаНаОбъект, Отказ);
	
	Если Не ПравоДоступа("Чтение", Метаданные.РегистрыСведений.ПериодичностьМедицинскихОсмотровРабочихМест) Тогда
		Возврат;
	КонецЕсли;
	
	ПроверитьЗаполнениеВредныхФакторовВидовРабот(ЭтотОбъект, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ПараметрыОповещения = Новый Структура("ВладелецФормы");
	ПараметрыОповещения.ВладелецФормы = ВладелецФормы;
	ОбщегоНазначенияКлиент.ОповеститьОбИзмененииОбъекта(Объект.Ссылка, ПараметрыОповещения);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НомерПриИзменении(Элемент)
	
	Если СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(Объект.Номер) Тогда
		Объект.ПорядковыйНомер = Число(Объект.Номер);
	КонецЕсли;
	
	ЗаполнитьНаименование();
	
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	ЗаполнитьНомер();
	СформироватьАвтоматическийНомер();
	ЗаполнитьНаименование();
	УстановитьНомерВручную(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ДолжностьПриИзменении(Элемент)
	ЗаполнитьНомер();
	СформироватьАвтоматическийНомер();
	ЗаполнитьНаименование();
	УстановитьНомерВручную(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура УсловияТрудаПриИзменении(Элемент)
	
	Если СоответствуетУсловиямТруда = 1 Тогда
		// Заполняем по данным условий труда.
		ЗаполнитьРеквизитыУсловийТруда();
	Иначе
		ПредложитьЗаполнениеПоДаннымУсловийТруда();
		УстановитьПредупреждениеОРазличияхСУсловиямиТруда();
	КонецЕсли;
	
	УстановитьДоступностьТумблераСоответствия(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура НомерВручнуюПриИзменении(Элемент)
	ЗаполнитьНомер();
	СформироватьАвтоматическийНомер();
	ЗаполнитьНаименование();
	УстановитьОтображениеНомера(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОсновноеРабочееМестоПриИзменении(Элемент)
	ЗаполнитьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура КлассыУсловийТрудаПоДолжностямКлассУсловийТрудаПриИзменении(Элемент)
	РедактированиеПериодическихСведенийКлиентСервер.ОбновитьОтображениеПолейВвода(ЭтотОбъект, "КлассыУсловийТрудаПоДолжностям", СсылкаНаОбъект);
	УстановитьДатуРегистрацииУсловийТрудаПоПериоду();
	ОбновитьПолеКлассыУсловийТрудаПоДолжностямДатаРегистрацииИзменений(ЭтотОбъект);
	УстановитьЗаголовокСвернутогоОтображенияСтраховыхВзносов(ЭтотОбъект);	
КонецПроцедуры

&НаКлиенте
Процедура КлассыУсловийТрудаПоДолжностямПериодПриИзменении(Элемент)
	УстановитьДатуРегистрацииУсловийТрудаПоПериоду();
	УстановитьЗаголовокСвернутогоОтображенияСтраховыхВзносов(ЭтотОбъект);	
КонецПроцедуры

&НаКлиенте
Процедура КлассыУсловийТрудаПоДолжностямДатаРегистрацииИзмененийПриИзменении(Элемент)
	ЗарплатаКадрыКлиент.ВводМесяцаПриИзменении(
		ЭтотОбъект,
		"КлассыУсловийТрудаПоДолжностям.ДатаРегистрацииИзменений",
		"КлассыУсловийТрудаПоДолжностямДатаРегистрацииИзмененийСтрокой",
		Модифицированность);	
КонецПроцедуры

&НаКлиенте
Процедура КлассыУсловийТрудаПоДолжностямДатаРегистрацииИзмененийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ЗарплатаКадрыКлиент.ВводМесяцаНачалоВыбора(
		ЭтотОбъект,
		ЭтотОбъект,
		"КлассыУсловийТрудаПоДолжностям.ДатаРегистрацииИзменений",
		"КлассыУсловийТрудаПоДолжностямДатаРегистрацииИзмененийСтрокой");
КонецПроцедуры

&НаКлиенте
Процедура КлассыУсловийТрудаПоДолжностямДатаРегистрацииИзмененийРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	ЗарплатаКадрыКлиент.ВводМесяцаРегулирование(
		ЭтотОбъект,
		"КлассыУсловийТрудаПоДолжностям.ДатаРегистрацииИзменений",
		"КлассыУсловийТрудаПоДолжностямДатаРегистрацииИзмененийСтрокой",
		Направление,
		Модифицированность);

КонецПроцедуры

&НаКлиенте
Процедура КлассыУсловийТрудаПоДолжностямДатаРегистрацииИзмененийАвтоПодбор(Элемент, Текст, ДанныеВыбора, Параметры, Ожидание, СтандартнаяОбработка)
	ЗарплатаКадрыКлиент.ВводМесяцаАвтоПодборТекста(Текст, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура КлассыУсловийТрудаПоДолжностямДатаРегистрацииИзмененийОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, Параметры, СтандартнаяОбработка)
	ЗарплатаКадрыКлиент.ВводМесяцаОкончаниеВводаТекста(Текст, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ВыплачиваетсяНадбавкаЗаВредностьПриИзменении(Элемент)
	
	УстановитьОтображениеПроцентаНадбавкиЗаВредность(ЭтотОбъект);
	УстановитьЗаголовокСвернутогоОтображенияДосрочнойПенсииВредности();
	
КонецПроцедуры

&НаКлиенте
Процедура ПроцентНадбавкиЗаВредностьПриИзменении(Элемент)
	УстановитьЗаголовокСвернутогоОтображенияДосрочнойПенсииВредности();
КонецПроцедуры

&НаКлиенте
Процедура ПроцентНадбавкиЗаВредностьРегулирование(Элемент, Направление, СтандартнаяОбработка)
	УстановитьЗаголовокСвернутогоОтображенияДосрочнойПенсииВредности();
КонецПроцедуры

&НаКлиенте
Процедура КоличествоДнейДополнительногоОтпускаВГодПриИзменении(Элемент)
	УстановитьЗаголовокСвернутогоОтображенияДосрочнойПенсииВредности();
КонецПроцедуры

&НаКлиенте
Процедура ВзимаютсяВзносыЗаЗанятыхНаРаботахСДосрочнойПенсиейФлажокПриИзменении(Элемент)
	
	Если НЕ ВзимаютсяВзносыЗаЗанятыхНаРаботахСДосрочнойПенсией Тогда
		Объект.ВзимаютсяВзносыЗаЗанятыхНаРаботахСДосрочнойПенсией = ПредопределенноеЗначение("Перечисление.ВидыРаботСДосрочнойПенсией.ПустаяСсылка");
	КонецЕсли;
	УстановитьОтображениеВзносов(ЭтотОбъект);
	УстановитьЗаголовокСвернутогоОтображенияДосрочнойПенсииВредности();
	
КонецПроцедуры

&НаКлиенте
Процедура ВзимаютсяВзносыЗаЗанятыхНаРаботахСДосрочнойПенсиейПриИзменении(Элемент)
	УстановитьЗаголовокСвернутогоОтображенияДосрочнойПенсииВредности();
КонецПроцедуры

&НаКлиенте
Процедура ОснованиеДосрочногоНазначенияПенсииПриИзменении(Элемент)
	УстановитьЗаголовокСвернутогоОтображенияДосрочнойПенсииВредности();
КонецПроцедуры

&НаКлиенте
Процедура ОсобыеУсловияТрудаПФРПриИзменении(Элемент)
	УстановитьЗаголовокСвернутогоОтображенияДосрочнойПенсииВредности();
КонецПроцедуры

&НаКлиенте
Процедура КодПозицииСпискаПФРПриИзменении(Элемент)
	УстановитьЗаголовокСвернутогоОтображенияДосрочнойПенсииВредности();
КонецПроцедуры

&НаКлиенте
Процедура СоответствуетУсловиямТрудаПриИзменении(Элемент)
	
	Если СоответствуетУсловиямТруда = 1 Тогда
		НачатьЗаполнениеПоДаннымУсловийТруда();
		Возврат;
	КонецЕсли;
	
	УстановитьДоступностьРеквизитовУсловийТруда(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ХарактерВыполняемыхРаботПФРНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(
		Элемент.ТекстРедактирования,
		ЭтотОбъект,
		"Объект.ХарактерВыполняемыхРаботПФР",
		Элемент.Заголовок);
		
КонецПроцедуры

&НаКлиенте
Процедура ПервичныеДокументыПФРНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(
		Элемент.ТекстРедактирования,
		ЭтотОбъект,
		"Объект.ПервичныеДокументыПФР",
		Элемент.Заголовок);
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыВредныеФакторыИВидыРаботМедицинскихОсмотров

&НаКлиенте
Процедура ВредныеФакторыИВидыРаботМедицинскихОсмотровВредныйФакторПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ВредныеФакторыИВидыРаботМедицинскихОсмотров.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные.ПериодичностьОсмотра = ПериодичностьОсмотраПоВредномуФактору(ТекущиеДанные.ВредныйФактор);
	
КонецПроцедуры

&НаКлиенте
Процедура ВредныеФакторыИВидыРаботМедицинскихОсмотровПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Если ОтменаРедактирования Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьПериодичностьОсмотровРабочихМест(СтрЗаменить(Элемент.Имя, "ВредныеФакторыИВидыРабот", ""));
	
КонецПроцедуры

&НаКлиенте
Процедура ВредныеФакторыИВидыРаботМедицинскихОсмотровПослеУдаления(Элемент)
	ОбновитьПериодичностьОсмотровРабочихМест(СтрЗаменить(Элемент.Имя, "ВредныеФакторыИВидыРабот", ""));
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыВредныеФакторыМедицинскихОсмотров

&НаКлиенте
Процедура ВредныеФакторыМедицинскихОсмотровВредныйФакторПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ВредныеФакторыМедицинскихОсмотров.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные.ПериодичностьОсмотра = ПериодичностьОсмотраПоВредномуФактору(ТекущиеДанные.ВредныйФактор);
	
КонецПроцедуры

&НаКлиенте
Процедура ВредныеФакторыМедицинскихОсмотровПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Если ОтменаРедактирования Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьПериодичностьОсмотровРабочихМест(СтрЗаменить(Элемент.Имя, "ВредныеФакторы", ""));
	
КонецПроцедуры

&НаКлиенте
Процедура ВредныеФакторыМедицинскихОсмотровПослеУдаления(Элемент)
	ОбновитьПериодичностьОсмотровРабочихМест(СтрЗаменить(Элемент.Имя, "ВредныеФакторы", ""));
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыВидыРаботМедицинскихОсмотров

&НаКлиенте
Процедура ВидыРаботМедицинскихОсмотровВидРаботПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ВидыРаботМедицинскихОсмотров.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные.ПериодичностьОсмотра = ПериодичностьОсмотраПоВредномуФактору(ТекущиеДанные.ВидРабот);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидыРаботМедицинскихОсмотровПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Если ОтменаРедактирования Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьПериодичностьОсмотровРабочихМест(СтрЗаменить(Элемент.Имя, "ВидыРабот", ""));
	
КонецПроцедуры

&НаКлиенте
Процедура ВидыРаботМедицинскихОсмотровПослеУдаления(Элемент)
	ОбновитьПериодичностьОсмотровРабочихМест(СтрЗаменить(Элемент.Имя, "ВидыРабот", ""));
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыВредныеФакторыИВидыРаботПсихиатрическихОсвидетельствований

&НаКлиенте
Процедура ВредныеФакторыИВидыРаботПсихиатрическихОсвидетельствованийВредныйФакторПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ВредныеФакторыИВидыРаботПсихиатрическихОсвидетельствований.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные.ПериодичностьОсмотра = ПериодичностьОсмотраПоВредномуФактору(ТекущиеДанные.ВредныйФактор);
	
КонецПроцедуры

&НаКлиенте
Процедура ВредныеФакторыИВидыРаботПсихиатрическихОсвидетельствованийПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Если ОтменаРедактирования Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьПериодичностьОсмотровРабочихМест(СтрЗаменить(Элемент.Имя, "ВредныеФакторыИВидыРабот", ""));
	
КонецПроцедуры

&НаКлиенте
Процедура ВредныеФакторыИВидыРаботПсихиатрическихОсвидетельствованийПослеУдаления(Элемент)
	ОбновитьПериодичностьОсмотровРабочихМест(СтрЗаменить(Элемент.Имя, "ВредныеФакторыИВидыРабот", ""));
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

&НаКлиенте
Процедура КлассУсловийТрудаИстория(Команда)
	РедактированиеПериодическихСведенийКлиент.ОткрытьИсторию("КлассыУсловийТрудаПоДолжностям", СсылкаНаОбъект, ЭтотОбъект, ИспользоватьСпециальнуюОценкуУсловийТруда);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоУсловиямТруда(Команда)
	НачатьЗаполнениеПоДаннымУсловийТруда();
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьВредныеФакторыВидыРаботМедицинские(Команда)
	
	ПараметрыФормы = Новый Структура("ИсключаяРабочееМесто, ВидОсмотра");
	ПараметрыФормы.ИсключаяРабочееМесто = Параметры.Ключ;
	ПараметрыФормы.ВидОсмотра = ВидМедицинскийОсмотр;
	
	ПараметрыОповещения = Новый Структура("ВидОсмотра");
	ПараметрыОповещения.ВидОсмотра = ПараметрыФормы.ВидОсмотра;
	
	ОбработчикОповещения = Новый ОписаниеОповещения("СкопироватьИзДругогоРабочегоМестаПослеВыбора", ЭтотОбъект, ПараметрыОповещения);
	ОткрытьФорму("Справочник.РабочиеМестаОхраныТруда.Форма.ВыборРабочегоМеста", ПараметрыФормы, ЭтотОбъект, , , , ОбработчикОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьВредныеФакторыВидыРаботПсихиатрические(Команда)
	
	ПараметрыФормы = Новый Структура("ИсключаяРабочееМесто, ВидОсмотра");
	ПараметрыФормы.ИсключаяРабочееМесто = Параметры.Ключ;
	ПараметрыФормы.ВидОсмотра = ВидПсихиатрическоеОсвидетельствование;
	
	ПараметрыОповещения = Новый Структура("ВидОсмотра");
	ПараметрыОповещения.ВидОсмотра = ПараметрыФормы.ВидОсмотра;
	
	ОбработчикОповещения = Новый ОписаниеОповещения("СкопироватьИзДругогоРабочегоМестаПослеВыбора", ЭтотОбъект, ПараметрыОповещения);
	ОткрытьФорму("Справочник.РабочиеМестаОхраныТруда.Форма.ВыборРабочегоМеста", ПараметрыФормы, ЭтотОбъект, , , , ОбработчикОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСписокВсехРезультатовРабочегоМеста(Команда)
	
	ПараметрыОткрытияФормы = Новый Структура;
	ПараметрыОткрытияФормы.Вставить("РабочееМесто", СсылкаНаОбъект);
	ПараметрыОткрытияФормы.Вставить("ЗакрыватьПриЗакрытииВладельца", Истина);
	
	ОткрытьФорму("Документ.РезультатыСпецоценкиУсловийТруда.ФормаСписка", ПараметрыОткрытияФормы, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ВвестиРезультатыСпецоценки(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Основание", СсылкаНаОбъект);
	
	ОткрытьФорму("Документ.РезультатыСпецоценкиУсловийТруда.Форма.ФормаДокумента", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.Свойства 
&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

&НаСервере
Процедура ЗаполнитьНаименование()
	
	НомерОсновногоРабочегоМеста = "";
	
	Если ЗначениеЗаполнено(АналогичныеРабочиеМестаСпециальнойОценкиУсловийТруда.РабочееМесто) Тогда
		НомерОсновногоРабочегоМеста = АналогичныеРабочиеМестаСпециальнойОценкиУсловийТруда.РабочееМесто.Номер;
	КонецЕсли;
	
	Объект.Наименование = ОхранаТруда.НаименованиеРабочегоМеста(
		Объект.Подразделение,
		Объект.Должность,
		Объект.Номер,
		НомерОсновногоРабочегоМеста);
	
	Заголовок = Объект.Наименование;
	
КонецПроцедуры

#Область МедицинскиеОсмотры

&НаСервереБезКонтекста
Процедура ПроверитьЗаполнениеВредныхФакторовВидовРабот(Форма, Отказ)
	
	Для Каждого СтрокаТаблицы Из Форма.ВредныеФакторыИВидыРаботМедицинскихОсмотров Цикл
		Если Не ЗначениеЗаполнено(СтрокаТаблицы.ВредныйФактор) Тогда
			ТекстСообщения = НСтр("ru = 'Вредный фактор не заполнен.'");
			Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(
				"ВредныеФакторыИВидыРаботМедицинскихОсмотров", СтрокаТаблицы.НомерСтроки, "ВредныйФактор");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , Поле, , Отказ);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого СтрокаТаблицы Из Форма.ВредныеФакторыИВидыРаботПсихиатрическихОсвидетельствований Цикл
		Если Не ЗначениеЗаполнено(СтрокаТаблицы.ВредныйФактор) Тогда
			ТекстСообщения = НСтр("ru = 'Вредный фактор не заполнен.'");
			Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(
				"ВредныеФакторыИВидыРаботПсихиатрическихОсвидетельствований", СтрокаТаблицы.НомерСтроки, "ВредныйФактор");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , Поле, , Отказ);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПрочитатьВредныеФакторы(Форма, СсылкаНаТекущийОбъект, ВидОсмотра, ВредныеФакторыИмяПоля)
	
	Если Найти(ВредныеФакторыИмяПоля, "ВредныеФакторыИВидыРабот") > 0 Тогда
		НаборЗаписей = РегистрыСведений.ВредныеФакторыИВидыРаботРабочегоМеста.СоздатьНаборЗаписей();
	Иначе
		НаборЗаписей = РегистрыСведений.ВредныеФакторыРабочегоМеста.СоздатьНаборЗаписей();
	КонецЕсли;
	
	НаборЗаписей.Отбор.РабочееМесто.Установить(СсылкаНаТекущийОбъект);
	НаборЗаписей.Отбор.ВидОсмотра.Установить(ВидОсмотра);
	НаборЗаписей.Прочитать();
	
	ЗначениеВДанныеФормы(НаборЗаписей, Форма[ВредныеФакторыИмяПоля]);
	
	ЗаполнитьПериодичностьВредныхФакторов(Форма, ВредныеФакторыИмяПоля);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьПериодичностьВредныхФакторов(Форма, ВредныеФакторыИмяПоля)
	
	ВредныеФакторы = Форма[ВредныеФакторыИмяПоля];
	
	ВредныеФакторыМассив = ВредныеФакторы.Выгрузить().ВыгрузитьКолонку("ВредныйФактор");
	ПериодичностьОсмотров = МедицинскиеОсмотры.ПериодичностьОсмотровПоВреднымФакторам(ВредныеФакторыМассив);
	Для Каждого СтрокаКоллекции Из ВредныеФакторы Цикл
		СтрокаКоллекции["ПериодичностьОсмотра"] = ПериодичностьОсмотров[СтрокаКоллекции.ВредныйФактор];
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаписатьВредныеФакторы(Форма, Отказ, ТекущийОбъект, ИмяТаблицы)
	
	НаборЗаписей = Форма.РеквизитФормыВЗначение(ИмяТаблицы + "МедицинскихОсмотров");
	Для каждого СтрокаНабора Из НаборЗаписей Цикл
		СтрокаНабора["РабочееМесто"] = ТекущийОбъект.Ссылка;
		СтрокаНабора["ВидОсмотра"] = Форма.ВидМедицинскийОсмотр;
	КонецЦикла;
	
	Если Форма.ИспользоватьПсихиатрическиеОсвидетельствования Тогда
		НаборЗаписейОПО = Форма.РеквизитФормыВЗначение(ИмяТаблицы + "ПсихиатрическихОсвидетельствований");
		Для каждого СтрокаНабора Из НаборЗаписейОПО Цикл
			СтрокаНабора["РабочееМесто"] = ТекущийОбъект.Ссылка;
			СтрокаНабора["ВидОсмотра"] = Форма.ВидПсихиатрическоеОсвидетельствование;
		КонецЦикла;
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(НаборЗаписейОПО, НаборЗаписей);
		НаборЗаписей.Отбор.ВидОсмотра.Использование = Ложь;
	Иначе
		НаборЗаписей.Отбор.ВидОсмотра.Использование = Истина;
		НаборЗаписей.Отбор.ВидОсмотра.Установить(Перечисления.ВидыОбследований.МедицинскийОсмотр);
	КонецЕсли;
	
	НаборЗаписей.Отбор.РабочееМесто.Установить(ТекущийОбъект.Ссылка);
	НаборЗаписей.Записать();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПрочитатьВидыРабот(Форма, СсылкаНаТекущийОбъект, ВидОсмотра, ВидыРаботИмяПоля)
	
	НаборЗаписей = РегистрыСведений.ВидыРаботМедицинскихОсмотровРабочегоМеста.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.РабочееМесто.Установить(СсылкаНаТекущийОбъект);
	НаборЗаписей.Отбор.ВидОсмотра.Установить(ВидОсмотра);
	НаборЗаписей.Прочитать();
	
	ЗначениеВДанныеФормы(НаборЗаписей, Форма[ВидыРаботИмяПоля]);
	
	ЗаполнитьПериодичностьВидовРабот(Форма, ВидыРаботИмяПоля);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьПериодичностьВидовРабот(Форма, ВидыРаботИмяПоля)
	
	ВидыРаботМассив = Форма[ВидыРаботИмяПоля].Выгрузить().ВыгрузитьКолонку("ВидРабот");
	ПериодичностьОсмотров = МедицинскиеОсмотры.ПериодичностьОсмотровПоВреднымФакторам(ВидыРаботМассив);
	Для Каждого СтрокаКоллекции Из Форма[ВидыРаботИмяПоля] Цикл
		СтрокаКоллекции["ПериодичностьОсмотра"] = ПериодичностьОсмотров[СтрокаКоллекции.ВидРабот];
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаписатьВидыРабот(Форма, Отказ, ТекущийОбъект)
	
	НаборЗаписей = Форма.РеквизитФормыВЗначение("ВидыРаботМедицинскихОсмотров");
	Для каждого СтрокаНабора Из НаборЗаписей Цикл
		СтрокаНабора["РабочееМесто"] = ТекущийОбъект.Ссылка;
		СтрокаНабора["ВидОсмотра"] = Форма.ВидМедицинскийОсмотр;
	КонецЦикла;
	
	Если Форма.ИспользоватьПсихиатрическиеОсвидетельствования Тогда
		НаборЗаписейОПО = Форма.РеквизитФормыВЗначение("ВидыРаботПсихиатрическихОсвидетельствований");
		Для каждого СтрокаНабора Из НаборЗаписейОПО Цикл
			СтрокаНабора["РабочееМесто"] = ТекущийОбъект.Ссылка;
			СтрокаНабора["ВидОсмотра"] = Форма.ВидПсихиатрическоеОсвидетельствование;
		КонецЦикла;
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(НаборЗаписейОПО, НаборЗаписей);
		НаборЗаписей.Отбор.ВидОсмотра.Использование = Ложь;
	Иначе
		НаборЗаписей.Отбор.ВидОсмотра.Использование = Истина;
		НаборЗаписей.Отбор.ВидОсмотра.Установить(Перечисления.ВидыОбследований.МедицинскийОсмотр);
	КонецЕсли;
	
	НаборЗаписей.Отбор.РабочееМесто.Установить(ТекущийОбъект.Ссылка);
	НаборЗаписей.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьИзДругогоРабочегоМестаПослеВыбора(ДругоеРабочееМесто, ДополнительныеПараметры) Экспорт
	
	Если ДругоеРабочееМесто = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры.Вставить("ДругоеРабочееМесто", ДругоеРабочееМесто);
	
	ЭтоМедицинскийОсмотр = ДополнительныеПараметры.ВидОсмотра = ВидМедицинскийОсмотр;
	ЭтоПсихиатрическоеОсвидетельствование = ДополнительныеПараметры.ВидОсмотра = ВидПсихиатрическоеОсвидетельствование;
	МедицинскиеПустые = ВредныеФакторыИВидыРаботМедицинскихОсмотров.Количество() = 0;
	ПсихиатрическиеПустые = ВредныеФакторыИВидыРаботПсихиатрическихОсвидетельствований.Количество() = 0;
	
	Если ЭтоМедицинскийОсмотр И МедицинскиеПустые Или ЭтоПсихиатрическоеОсвидетельствование И ПсихиатрическиеПустые Тогда
		НачатьКопированиеИзДругогоРабочегоМеста(ДругоеРабочееМесто, ДополнительныеПараметры);
		Возврат;
	КонецЕсли;
	
	Если ЭтоМедицинскийОсмотр Тогда
		ТекстВопроса = НСтр("ru = 'Списки вредных факторов и видов работ для медицинских осмотров будут очищены перед копированием.
	                         |Продолжить?'");
	ИначеЕсли ЭтоПсихиатрическоеОсвидетельствование Тогда
		ТекстВопроса = НСтр("ru = 'Списки вредных факторов и видов работ для психиатрических освидетельствований будут очищены перед копированием.
	                         |Продолжить?'");
	Иначе
		ТекстВопроса = НСтр("ru = 'Списки вредных факторов и видов работ будут очищены перед копированием.
	                         |Продолжить?'");
	КонецЕсли;
	
	ОбработчикОповещения = Новый ОписаниеОповещения("СкопироватьИзДругогоРабочегоМестаПослеВопроса", ЭтотОбъект, ДополнительныеПараметры);
	ПоказатьВопрос(ОбработчикОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьИзДругогоРабочегоМестаПослеВопроса(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	НачатьКопированиеИзДругогоРабочегоМеста(ДополнительныеПараметры.ДругоеРабочееМесто, ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьКопированиеИзДругогоРабочегоМеста(ДругоеРабочееМесто, ДополнительныеПараметры)
	
	СкопироватьВредныеФакторыВидыРаботНаСервере(ДругоеРабочееМесто, ДополнительныеПараметры.ВидОсмотра);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПериодичностьОсмотраПоВредномуФактору(ВредныйФактор)
	
	ВредныеФакторы = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ВредныйФактор);
	ПериодичностьОсмотров = МедицинскиеОсмотры.ПериодичностьОсмотровПоВреднымФакторам(ВредныеФакторы);
	Возврат ПериодичностьОсмотров[ВредныйФактор];
	
КонецФункции

&НаСервереБезКонтекста
Процедура УстановитьВидимостьГруппеСписковСтарыхВредныхФакторов(Форма)

    ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы, 
		"ВредныеФакторыВидыРаботМедицинскихОсмотровГруппа",
		"Видимость",
		Форма.ВредныеФакторыМедицинскихОсмотров.Количество() > 0 Или Форма.ВидыРаботМедицинскихОсмотров.Количество() > 0);

КонецПроцедуры
 
#КонецОбласти

&НаСервере
Процедура ЗаполнитьНомер()
	
	Если Объект.НомерВручную Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ИспользоватьСпециальнуюОценкуУсловийТруда Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ПорядковыйНомер)
		И Не Константы.КонтролироватьУникальностьНомеровРабочихМест.Получить() = Истина Тогда
			
		Возврат;
	КонецЕсли;
	
	НомерРабочегоМестаСвободен = Справочники.РабочиеМестаОхраныТруда.РезультатЗанятостиНомераРабочегоМеста(
			Объект.Номер, Объект.Подразделение, Объект.Владелец, СсылкаНаОбъект).Пустой();
	
	Если НомерРабочегоМестаСвободен Тогда
		Возврат;
	КонецЕсли;
	
	Объект.ПорядковыйНомер = 1 + Справочники.РабочиеМестаОхраныТруда.МаксимальныйНомерРабочегоМеста(Объект.Владелец, Объект.Подразделение);
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьАналогичностьРабочегоМеста()
	
	РедактированиеПериодическихСведений.ПрочитатьЗаписьДляРедактированияВФорме(ЭтотОбъект, "АналогичныеРабочиеМестаСпециальнойОценкиУсловийТруда", СсылкаНаОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьКлассыУсловийТрудаПоДолжностям()
	
	РедактированиеПериодическихСведений.ПрочитатьЗаписьДляРедактированияВФорме(ЭтотОбъект, "КлассыУсловийТрудаПоДолжностям", СсылкаНаОбъект);
	ОбновитьПолеКлассыУсловийТрудаПоДолжностямПериод(ЭтотОбъект);
	ОбновитьПолеКлассыУсловийТрудаПоДолжностямДатаРегистрацииИзменений(ЭтотОбъект);
	УстановитьЗаголовокСвернутогоОтображенияСтраховыхВзносов(ЭтотОбъект);
		
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьПолеКлассыУсловийТрудаПоДолжностямДатаРегистрацииИзменений(Форма)
	
	ЗарплатаКадрыКлиентСервер.ЗаполнитьМесяцПоДате(Форма,
		"КлассыУсловийТрудаПоДолжностям.ДатаРегистрацииИзменений",
		"КлассыУсловийТрудаПоДолжностямДатаРегистрацииИзмененийСтрокой");
	
	Форма.Элементы.КлассыУсловийТрудаПоДолжностямДатаРегистрацииИзменений.АвтоОтметкаНезаполненного =
		Форма.Элементы.КлассыУсловийТрудаПоДолжностямПериод.АвтоОтметкаНезаполненного;
	
	Если Не Форма.Элементы.КлассыУсловийТрудаПоДолжностямДатаРегистрацииИзменений.АвтоОтметкаНезаполненного
		И Не ЗначениеЗаполнено(Форма.КлассыУсловийТрудаПоДолжностям.Период) Тогда
		
		Форма.Элементы.КлассыУсловийТрудаПоДолжностямДатаРегистрацииИзменений.ОтметкаНезаполненного = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьПолеКлассыУсловийТрудаПоДолжностямПериод(Форма)
	
	РедактированиеПериодическихСведенийКлиентСервер.ОбновитьОтображениеПолейВвода(Форма, "КлассыУсловийТрудаПоДолжностям", Форма.СсылкаНаОбъект);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьДоступностьЭлементов(Форма)
	
	ИспользоватьСпециальнуюОценкуУсловийТруда = Форма.ИспользоватьСпециальнуюОценкуУсловийТруда;
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		"ГруппаСпецоценкаУсловийТруда",
		"Видимость",
		ИспользоватьСпециальнуюОценкуУсловийТруда);
		
	УсловияТрудаТолькоПросмотр =
		ОбщегоНазначенияКлиентСервер.ЗначениеСвойстваЭлементаФормы(Форма.Элементы, "УсловияТруда", "ТолькоПросмотр");
	
	ЗапрещатьРедактирование = ИспользоватьСпециальнуюОценкуУсловийТруда Или УсловияТрудаТолькоПросмотр;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		"КлассыУсловийТрудаПоДолжностямПериод",
		"ТолькоПросмотр",
		ЗапрещатьРедактирование);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		"КлассыУсловийТрудаПоДолжностямКлассУсловийТруда",
		"ТолькоПросмотр",
		ЗапрещатьРедактирование);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		"КлассыУсловийТрудаПоДолжностямДатаРегистрацииИзменений",
		"ТолькоПросмотр",
		ЗапрещатьРедактирование);
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		"НомерВручную",
		"Доступность",
		Форма.РабочееМестоДоступноДляРедактирования);
		
	УстановитьДоступностьРеквизитовУсловийТруда(Форма);
	УстановитьДоступностьТумблераСоответствия(Форма);
	УстановитьОтображениеНомера(Форма);
	УстановитьОтображениеВзносов(Форма);
	УстановитьОтображениеПроцентаНадбавкиЗаВредность(Форма);
	
КонецПроцедуры	

&НаСервере
Процедура ПриПолученииДанныхНаСервере(ТекущийОбъект)
	
	ВзимаютсяВзносыЗаЗанятыхНаРаботахСДосрочнойПенсией = ЗначениеЗаполнено(Объект.ВзимаютсяВзносыЗаЗанятыхНаРаботахСДосрочнойПенсией);
	СоответствуетУсловиямТруда = ТекущийОбъект.СоответствуетУсловиямТруда;
	РабочееМестоДоступноДляРедактирования = ПравоДоступа("Редактирование", Метаданные.Справочники.РабочиеМестаОхраныТруда);
	
	ИспользоватьСпециальнуюОценкуУсловийТруда = ПолучитьФункциональнуюОпцию("ИспользоватьСпециальнуюОценкуУсловийТруда");
	
	ИнициализироватьМедицинскиеОсмотры();	
	ИнициализироватьРезультатыСпецоценки(ТекущийОбъект);
	
	УстановитьДоступностьЭлементов(ЭтотОбъект);
	УстановитьЗаголовокСвернутогоОтображенияДосрочнойПенсииВредности();
	УстановитьПредупреждениеОРазличияхСУсловиямиТруда();
	
КонецПроцедуры

#Область МедицинскиеОсмотры

&НаСервере
Процедура ИнициализироватьМедицинскиеОсмотры()
	
	ИспользоватьПсихиатрическиеОсвидетельствования = 
		ПолучитьФункциональнуюОпцию("ИспользоватьПсихиатрическиеОсвидетельствования");
	
	ВидМедицинскийОсмотр = Перечисления.ВидыОбследований.МедицинскийОсмотр;
	ВидПсихиатрическоеОсвидетельствование = Перечисления.ВидыОбследований.ПсихиатрическоеОсвидетельствование;
	
	Если Не ПравоДоступа("Чтение", Метаданные.РегистрыСведений.ПериодичностьМедицинскихОсмотровРабочихМест) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "СтраницыВредныеФакторыВидыРабот", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "ГруппаМедицинскиеОсмотры", "Видимость", Ложь);
		Возврат;
	КонецЕсли;
	
	Если Не ПравоДоступа("Изменение", Метаданные.РегистрыСведений.ВредныеФакторыИВидыРаботРабочегоМеста)
		Или ИспользоватьСпециальнуюОценкуУсловийТруда Тогда
			
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "ВредныеФакторыИВидыРаботМедицинскихОсмотров", "ТолькоПросмотр", Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "СкопироватьВредныеФакторыВидыРаботМедицинские", "Доступность", Ложь);
		Если ИспользоватьПсихиатрическиеОсвидетельствования Тогда
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
				Элементы, "ВредныеФакторыИВидыРаботПсихиатрическихОсвидетельствований", "ТолькоПросмотр", Истина);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
				Элементы, "СкопироватьВредныеФакторыВидыРаботПсихиатрические", "Доступность", Ложь);
		КонецЕсли;
	КонецЕсли;
	
	Если Не ИспользоватьСпециальнуюОценкуУсловийТруда Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "ГруппаВредныеФакторыПоРезультатамСпецоценки", "Видимость", Ложь);
	КонецЕсли;
	
	Если Не ПравоДоступа("Изменение", Метаданные.РегистрыСведений.ВредныеФакторыРабочегоМеста) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "ВредныеФакторыМедицинскихОсмотров", "ТолькоПросмотр", Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "СкопироватьВредныеФакторыВидыРаботМедицинские", "Доступность", Ложь);
		Если ИспользоватьПсихиатрическиеОсвидетельствования Тогда
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
				Элементы, "ВредныеФакторыПсихиатрическихОсвидетельствований", "ТолькоПросмотр", Истина);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
				Элементы, "СкопироватьВредныеФакторыВидыРаботПсихиатрические", "Доступность", Ложь);
		КонецЕсли;
	КонецЕсли;
	
	Если Не ПравоДоступа("Изменение", Метаданные.РегистрыСведений.ВидыРаботМедицинскихОсмотровРабочегоМеста) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "ВидыРаботМедицинскихОсмотров", "ТолькоПросмотр", Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "СкопироватьВредныеФакторыВидыРаботМедицинские", "Доступность", Ложь);
		Если ИспользоватьПсихиатрическиеОсвидетельствования Тогда
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
				Элементы, "ВидыРаботПсихиатрическихОсвидетельствований", "ТолькоПросмотр", Истина);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
				Элементы, "СкопироватьВредныеФакторыВидыРаботПсихиатрические", "Доступность", Ложь);
		КонецЕсли;
	КонецЕсли;
	
	ГруппаМедицинскиеОсмотры = Элементы.ГруппаМедицинскиеОсмотры;
	
	СворачиватьМедосмотры = ПолучитьФункциональнуюОпцию("ПрименятьРезультатыСпециальнойОценкиУсловийТрудаРасширенная")
					 Или ПолучитьФункциональнуюОпцию("ИспользоватьНадбавкуЗаВредность")
					 Или ПолучитьФункциональнуюОпцию("ИспользуютсяРаботыСДосрочнойПенсией");
		
	Если Не СворачиватьМедосмотры Тогда
		ГруппаМедицинскиеОсмотры.Показать();
	КонецЕсли;
	
	Если Не ИспользоватьПсихиатрическиеОсвидетельствования Тогда
		Элементы.Переместить(Элементы.ГруппаОсмотрыПоПриказу29Н, ГруппаМедицинскиеОсмотры);
	Иначе
		Если Не Элементы.ГруппаОсмотрыПоПриказу29Н.Родитель = Элементы.СтраницаОсмотрыПоПриказу29Н Тогда
			Элементы.Переместить(Элементы.ГруппаОсмотрыПоПриказу29Н, Элементы.СтраницаОсмотрыПоПриказу29Н);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьВредныеФакторыВидыРабот(ТекущийОбъект, ВидОсмотра = Неопределено, ЭтоКопирование = Ложь)
	
	Если Не ВидОсмотра = ВидПсихиатрическоеОсвидетельствование Тогда
		ПрочитатьВредныеФакторы(ЭтотОбъект, ТекущийОбъект.Ссылка, ВидМедицинскийОсмотр, "ВредныеФакторыИВидыРаботМедицинскихОсмотров");
		Если ЭтоКопирование Тогда
		    ВредныеФакторыМедицинскихОсмотров.Очистить();
			ВидыРаботМедицинскихОсмотров.Очистить();		
		Иначе
			ПрочитатьВредныеФакторы(ЭтотОбъект, ТекущийОбъект.Ссылка, ВидМедицинскийОсмотр, "ВредныеФакторыМедицинскихОсмотров");
			ПрочитатьВидыРабот(ЭтотОбъект, ТекущийОбъект.Ссылка, ВидМедицинскийОсмотр, "ВидыРаботМедицинскихОсмотров");
		КонецЕсли; 
		ОбновитьПериодичностьОсмотровРабочихМест("МедицинскихОсмотров");
		УстановитьВидимостьГруппеСписковСтарыхВредныхФакторов(ЭтотОбъект);
	КонецЕсли;
	
	Если Не ВидОсмотра = ВидМедицинскийОсмотр Тогда
		ПрочитатьВредныеФакторы(ЭтотОбъект, ТекущийОбъект.Ссылка, ВидПсихиатрическоеОсвидетельствование,
			"ВредныеФакторыИВидыРаботПсихиатрическихОсвидетельствований");
		ОбновитьПериодичностьОсмотровРабочихМест("ПсихиатрическихОсвидетельствований");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьПериодичностьОсмотровРабочихМест(ИмяВидОсмотра, УчитыватьСтарыеФакторы = Истина)
	
	ВредныеФакторыРаботыМассив = Новый Массив;
	
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ВредныеФакторыРаботыМассив, ОбщегоНазначения.ВыгрузитьКолонку(
		ЭтотОбъект["ВредныеФакторыИВидыРабот" + ИмяВидОсмотра], "ВредныйФактор", Истина), Истина);
	
	Если УчитыватьСтарыеФакторы Тогда
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ВредныеФакторыРаботыМассив, ОбщегоНазначения.ВыгрузитьКолонку(
			ЭтотОбъект["ВредныеФакторы" + ИмяВидОсмотра], "ВредныйФактор", Истина), Истина);
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ВредныеФакторыРаботыМассив, ОбщегоНазначения.ВыгрузитьКолонку(
			ЭтотОбъект["ВидыРабот" + ИмяВидОсмотра], "ВидРабот", Истина), Истина);
	КонецЕсли;
	
	ПериодичностьИмяВидОсмотра = "Периодичность" + ИмяВидОсмотра;
	
	ОписаниеПериодичности = МедицинскиеОсмотры.МинимальнаяПериодичностьОсмотров(ВредныеФакторыРаботыМассив);
	
	ЭтотОбъект[ПериодичностьИмяВидОсмотра] = ОписаниеПериодичности.Представление;
	
	Если ПустаяСтрока(ЭтотОбъект[ПериодичностьИмяВидОсмотра]) Тогда
		ЭтотОбъект[ПериодичностьИмяВидОсмотра] = НСтр("ru = 'Не проходят'");
	КонецЕсли;
	
	УстановитьЗаголовокСвернутогоОтображенияМедосмотров();
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьРезультатыСпецоценки(ТекущийОбъект)
	
	УстановитьПривилегированныйРежим(Истина);
	ПрочитатьВредныеФакторыВидыРабот(ТекущийОбъект);
	УстановитьЗаголовокРезультатовСпецоценки();
	ПрочитатьКлассыУсловийТрудаПоДолжностям();
	ПрочитатьАналогичностьРабочегоМеста();
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЗаголовокРезультатовСпецоценки()
	
	Если Не ИспользоватьСпециальнуюОценкуУсловийТруда Тогда
		Возврат;
	КонецЕсли;
	
	// АПК:96 -выкл результат должен содержать уникальные значения
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РезультатыСпецоценкиУсловийТрудаРабочиеМеста.Ссылка КАК Документ,
		|	РезультатыСпецоценкиУсловийТрудаРабочиеМеста.Ссылка.Дата КАК Дата
		|ПОМЕСТИТЬ ВТ_РезультатыСпецоценки
		|ИЗ
		|	Документ.РезультатыСпецоценкиУсловийТруда.РабочиеМеста КАК РезультатыСпецоценкиУсловийТрудаРабочиеМеста
		|ГДЕ
		|	РезультатыСпецоценкиУсловийТрудаРабочиеМеста.РабочееМесто = &РабочееМесто
		|	И РезультатыСпецоценкиУсловийТрудаРабочиеМеста.Ссылка.Проведен
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РезультатыСпецоценкиУсловийТрудаАналогичныеМеста.Ссылка,
		|	РезультатыСпецоценкиУсловийТрудаАналогичныеМеста.Ссылка.Дата
		|ИЗ
		|	Документ.РезультатыСпецоценкиУсловийТруда.АналогичныеМеста КАК РезультатыСпецоценкиУсловийТрудаАналогичныеМеста
		|ГДЕ
		|	РезультатыСпецоценкиУсловийТрудаАналогичныеМеста.АналогичноеМесто = &РабочееМесто
		|	И РезультатыСпецоценкиУсловийТрудаАналогичныеМеста.Ссылка.Проведен
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ВТ_РезультатыСпецоценки.Документ КАК Документ,
		|	ВТ_РезультатыСпецоценки.Дата КАК Дата
		|ИЗ
		|	ВТ_РезультатыСпецоценки КАК ВТ_РезультатыСпецоценки
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата УБЫВ";
	
	// АПК:96 -вкл
		
	Запрос.УстановитьПараметр("РабочееМесто", СсылкаНаОбъект);
	ВыборкаДокументов = Запрос.Выполнить().Выбрать();
	
	Если ВыборкаДокументов.Следующий() Тогда
		ЕстьРезультатыСпецоценки = Истина;
		ЗаголовокДекорации = СтроковыеФункции.ФорматированнаяСтрока(
			НСтр("ru='Вредные факторы недоступны для редактирования, т.к. устанавливаются по результатам спецоценки.
				|См. <a href=""%1"">%2</a>.'"), ПолучитьНавигационнуюСсылку(ВыборкаДокументов.Документ), Строка(ВыборкаДокументов.Документ));
	Иначе
		ЕстьРезультатыСпецоценки = Ложь;
		ЗаголовокДекорации = НСтр("ru='Вредные факторы недоступны для редактирования, т.к. устанавливаются по результатам спецоценки.'");
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ВредныеФакторыПоРезультатамСпецоценкиНадпись",
		"Заголовок",
		ЗаголовокДекорации);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ОткрытьСписокВсехРезультатовСпецоценкиРабочегоМеста",
		"Видимость",
		ЕстьРезультатыСпецоценки);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ВвестиРезультатыСпецоценки",
		"Видимость",
		Не ЕстьРезультатыСпецоценки);
		
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура УстановитьДатуРегистрацииУсловийТрудаПоПериоду()
	
	КлассыУсловийТрудаПоДолжностям.ДатаРегистрацииИзменений = НачалоМесяца(КлассыУсловийТрудаПоДолжностям.Период);	
	ЗарплатаКадрыКлиентСервер.ЗаполнитьМесяцПоДате(ЭтотОбъект, "КлассыУсловийТрудаПоДолжностям.ДатаРегистрацииИзменений", "КлассыУсловийТрудаПоДолжностямДатаРегистрацииИзмененийСтрокой");
	
КонецПроцедуры	

&НаСервере
Процедура ПрочитатьНаборЗаписейПериодическихСведений(ИмяРегистра, ВедущийОбъект) Экспорт
	
	РедактированиеПериодическихСведений.ПрочитатьНаборЗаписей(ЭтотОбъект, ИмяРегистра, ВедущийОбъект);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьНомерВручную(Форма)
	
	Объект = Форма.Объект;
	
	Если ПустаяСтрока(Объект.Номер) Тогда
		Объект.НомерВручную = Истина;
		УстановитьОтображениеНомера(Форма);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьАвтоматическийНомер()
	
	Если Объект.НомерВручную Тогда
		Возврат;
	КонецЕсли;
	
	Объект.Номер = Строка(Объект.ПорядковыйНомер);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтображениеПроцентаНадбавкиЗаВредность(Форма)
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		"ПроцентНадбавкиЗаВредность",
		"Доступность",
		Форма.Объект.ВыплачиваетсяНадбавкаЗаВредность);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтображениеВзносов(Форма)
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		"ВзимаютсяВзносыЗаЗанятыхНаРаботахСДосрочнойПенсиейФлажок",
		"Доступность",
		Форма.РабочееМестоДоступноДляРедактирования);
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		"ВзимаютсяВзносыЗаЗанятыхНаРаботахСДосрочнойПенсией",
		"Доступность",
		Форма.ВзимаютсяВзносыЗаЗанятыхНаРаботахСДосрочнойПенсией);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтображениеНомера(Форма)
	
	Объект = Форма.Объект;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		"Номер",
		"ТолькоПросмотр",
		Не Объект.НомерВручную);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		"Номер",
		"АвтоОтметкаНезаполненного",
		Объект.НомерВручную);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		"Номер",
		"ОтметкаНезаполненного",
		Объект.НомерВручную И ЗначениеЗаполнено(Объект.Номер));
	
КонецПроцедуры

&НаКлиенте
Процедура ПредложитьЗаполнениеПоДаннымУсловийТруда()
	
	ЗаголовокВопроса = НСтр("ru = 'Заполнение по данным условий труда'");
	
	ТекстВопроса = НСтр("ru = 'Данные о досрочной пенсии, надбавке за вредность и страховых взносах - можно заменить аналогичными сведениями из условий труда.
						|Заменить?'");
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершитьЗаполнениеПоДаннымУсловийТруда", ЭтотОбъект);
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , , ЗаголовокВопроса);
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьЗаполнениеПоДаннымУсловийТруда()
	
	ЗаголовокВопроса = НСтр("ru = 'Заполнение по данным условий труда'");
	
	ТекстВопроса = НСтр("ru = 'Данные о досрочной пенсии, надбавке за вредность и страховых взносах - будут заменены аналогичными сведениями из условий труда.
						|Продолжить?'");
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершитьЗаполнениеПоДаннымУсловийТруда", ЭтотОбъект);
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , , ЗаголовокВопроса);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьЗаполнениеПоДаннымУсловийТруда(Ответ, ДополнительныеПараметры) Экспорт

	Если Ответ = КодВозвратаДиалога.Нет Тогда
		// Пользователь отказался от замены реквизитов из условий труда.
		СоответствуетУсловиямТруда = 0;
		УстановитьДоступностьРеквизитовУсловийТруда(ЭтаФорма);
		Возврат;
	КонецЕсли;
	
	ЗаполнитьРеквизитыУсловийТруда();
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьТумблераСоответствия(Форма)
	
	ТумблерДоступен = Форма.РабочееМестоДоступноДляРедактирования И ЗначениеЗаполнено(Форма.Объект.УсловияТруда);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		"СоответствуетУсловиямТруда",
		"Доступность",
		ТумблерДоступен);
	
	Если Не ТумблерДоступен Тогда 
		Форма.СоответствуетУсловиямТруда = 0;
		УстановитьДоступностьРеквизитовУсловийТруда(Форма);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьРеквизитовУсловийТруда(Форма)
	
	ДоступностьСведений = Форма.СоответствуетУсловиямТруда = 0;
	
	Форма.Элементы.ВредностьГруппа.ТолькоПросмотр = Не ДоступностьСведений;
	Форма.Элементы.ДосрочнаяПенсияГруппа.ТолькоПросмотр = Не ДоступностьСведений;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьЗаголовокСвернутогоОтображенияСтраховыхВзносов(Форма)
	
	ЗаголовокСвернутогоОтображения = "";
	
	КлассУсловийТруда = ОбщегоНазначенияКлиентСервер.ПолучитьРеквизитФормыПоПути(
		Форма, "КлассыУсловийТрудаПоДолжностям.КлассУсловийТруда");
	Период = ОбщегоНазначенияКлиентСервер.ПолучитьРеквизитФормыПоПути(
		Форма, "КлассыУсловийТрудаПоДолжностям.Период");
		
	Если ЗначениеЗаполнено(КлассУсловийТруда) Тогда
		ЗаголовокСвернутогоОтображения = СтрШаблон(НСтр("ru = '%1 установлен с %2'"),
			Строка(КлассУсловийТруда), Формат(Период, "ДЛФ=DD"));
	КонецЕсли; 

	Форма.Элементы.ГруппаОсобенностиИсчисленияСтраховыхВзносов.ЗаголовокСвернутогоОтображения =
		?(ПустаяСтрока(ЗаголовокСвернутогоОтображения),
		  Форма.Элементы.ГруппаОсобенностиИсчисленияСтраховыхВзносов.Заголовок,
		  ЗаголовокСвернутогоОтображения);

КонецПроцедуры

&НаСервере
Процедура УстановитьЗаголовокСвернутогоОтображенияДосрочнойПенсииВредности()
	
	ЗаголовокСвернутогоОтображения = ОхранаТруда.ЗаголовокНаОснованииНабораДанных(ОхранаТруда.ЗначенияВзносовВредностиПФР(Объект));
	
	Элементы.ДосрочнаяПенсияВредностьВзносы.ЗаголовокСвернутогоОтображения =
		?(ПустаяСтрока(ЗаголовокСвернутогоОтображения),
		  Элементы.ДосрочнаяПенсияВредностьВзносы.Заголовок,
		  ЗаголовокСвернутогоОтображения);

КонецПроцедуры

&НаСервере
Процедура УстановитьЗаголовокСвернутогоОтображенияМедосмотров()
	
	ЗаголовокСвернутогоОтображения = НСтр("ru = 'Медицинские осмотры:'") + Символы.НПП + ПериодичностьМедицинскихОсмотров;
	
	Если ИспользоватьПсихиатрическиеОсвидетельствования Тогда
		ЗаголовокСвернутогоОтображения = ЗаголовокСвернутогоОтображения + Символы.ПС
			+ НСтр("ru = 'Психиатрические освидетельствования:'") + Символы.НПП
			+ ПериодичностьПсихиатрическихОсвидетельствований;
	КонецЕсли; 

	Элементы.ГруппаМедицинскиеОсмотры.ЗаголовокСвернутогоОтображения = ЗаголовокСвернутогоОтображения;

КонецПроцедуры

&НаСервере
Процедура УстановитьПредупреждениеОРазличияхСУсловиямиТруда()
	
	Элементы.РазличияСУсловиямиТрудаГруппа.Видимость = Ложь;
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьНадбавкуЗаВредность")
		И Не ПолучитьФункциональнуюОпцию("ИспользуютсяРаботыСДосрочнойПенсией") Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.УсловияТруда) Тогда
		Возврат;
	КонецЕсли;
	
	УсловияТруда = ОхранаТруда.ЗначенияВзносовВредностиПФР(Объект.УсловияТруда);
	
	Если Не Справочники.РабочиеМестаОхраныТруда.РеквизитыРабочегоМестаСоответствуютУсловиямТруда(Объект, УсловияТруда) Тогда
		Элементы.РазличияСУсловиямиТрудаГруппа.Видимость = Истина;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРеквизитыУсловийТруда()

	Если Не ЗначениеЗаполнено(Объект.УсловияТруда) Тогда
		Возврат;
	КонецЕсли;
	
	РабочееМестоОбъект = РеквизитФормыВЗначение("Объект");
	РабочееМестоОбъект.ЗаполнитьПоУсловиямТруда(Объект.УсловияТруда);
	ЗначениеВРеквизитФормы(РабочееМестоОбъект, "Объект");
	
	ВзимаютсяВзносыЗаЗанятыхНаРаботахСДосрочнойПенсией = ЗначениеЗаполнено(Объект.ВзимаютсяВзносыЗаЗанятыхНаРаботахСДосрочнойПенсией);
	СоответствуетУсловиямТруда = Объект.СоответствуетУсловиямТруда;
	
	УстановитьДоступностьЭлементов(ЭтотОбъект);
	УстановитьПредупреждениеОРазличияхСУсловиямиТруда();
	УстановитьЗаголовокСвернутогоОтображенияДосрочнойПенсииВредности();
	
КонецПроцедуры

&НаСервере
Процедура СкопироватьВредныеФакторыВидыРаботНаСервере(ДругоеРабочееМесто, ВидОсмотра) Экспорт
	ПрочитатьВредныеФакторыВидыРабот(ДругоеРабочееМесто, ВидОсмотра, Истина);
	Модифицированность = Истина;
КонецПроцедуры

#КонецОбласти
